cask_args appdir: '/Applications'

tap 'homebrew/bundle'
#tap 'homebrew/homebrew-science'
#tap 'caskroom/drivers'
tap 'puma/puma'
# tap 'seanhoughton/homebrew-astronomy'

brew 'ack'
brew 'cdrtools'
brew 'cfitsio'
brew 'coreutils'
brew 'ctags'
#brew 'docker'
brew 'docker-machine-driver-xhyve'
brew 'kubectl'
brew 'exa'
brew 'go'
brew 'gphoto2'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'libraw'
brew 'md5sha1sum'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'shellcheck'
brew 'brew-gem'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tcping'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'xhyve'

cask '1password'
cask 'beyond-compare'
cask 'cyberduck'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'fliqlo'
cask 'gitkraken'
#cask 'google-chrome'
#cask 'google-drive'
cask 'indi-server'
cask 'iterm2'
cask 'omnidisksweeper'
cask 'osxfuse'
cask 'macdown'
cask 'p4v'
cask 'perforce'
cask 'royal-tsx'
#cask 'sbig-universal-driver'
cask 'slack'
cask 'soulver'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'