cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'ctags'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'brew-gem'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'cyberduck'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive'
cask 'p4v'
cask 'perforce'
cask 'royal-tsx'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'